package chapter2;

/* Напишите класс, который выводит на экран в одной строке ваше имя и
фамилию, в друтой - телефон, все это - в рамке из «звездочек» ().
Например:
Иван Иванов
7-841-266666
 */

public class Task11 {
    public static void main(String[] args) {
        System.out.println("*******************");
        System.out.println("*Алексей Кудрявцев*");
        System.out.println("**8-555-444-33-22**");
        System.out.println("*******************");
    }
}
