package chapter2;

// Напишите класс, который выводит на экран «песочные часы», составленные из какого-либо символа.


public class Task12 {
    public static void main(String[] args) {
        System.out.println("!!!!!!!");
        System.out.println(" !   !");
        System.out.println("  ! !");
        System.out.println("   !");
        System.out.println("  ! !");
        System.out.println(" !   !");
        System.out.println("!!!!!!!");
    }
}
