package chapter2;

/*Напишите класс, который выводит на экран тем же количеством команд знаки,
которые выводились в задании № 3, но все знаки должны
выводиться в одной строке.
 */

public class Task4 {
    public static void main(String[] args) {
        System.out.println("+++!!!!??");
    }
}
