package chapter2;

/*Напишите класс, который выводит на экран надпись
"H-e-1-1-o-,-f-r-i-e-n-d!"

 */

public class Task2 {
    public static void main(String[] args) {
        System.out.println("H-e-l-l-o-,-f-r-i-e-n-d!");
    }
}
