package chapter2;

// Напишите класс, который выводит на экран надпись "Hello, world!"


public class Task1 {
    public static void main(String[] args) {

        System.out.println("Hello, world");
    }
}
