package chapter15;

/*
Игра в кости проходит по следующим правилам: в каждом «круге» игры
два игрока бросают каждый по два кубика, на гранях которых - цифры
от 1до6. Игра заканчивается, если хотя бы один из победителей набрал
больше 100 очков. Если один из игроков набрал больше 100 очков, а
второй - нет, набравший более 100 объявляется победителем. Если оба
игрока набрали более 100 очков, объявляется ничья.
Напишите класс, реализующий модель этой игры и определяющий результат,
 в соответствии с которым на экран выводится текстовое сообщение.
 */

public class Task52 {
}
